import {React} from 'react';
import Nav from "../component/Nav";
import '../style/Terms.css';


function CardProfile(){
    return(
        <div className="container-fluid">
            
        <Nav/>

        <div className="bg-warning" dir="rtl">
            <h1 className="text-center">תנאי שימוש ומדיניות פרטיות בשירותי האתר</h1>
            <p align="right" dir="rtl">
            תנאי השימוש ומדיניות הפרטיות שלהלן (יחד - "התקנון") חלים על כל גולש או משתמש בשירותים הדיגיטליים השונים (להלן "הגולש" או "המשתמש") המוצעים באתר ו/או ביישומון ("אפליקצייה") זה ו/או באמצעותם יחד או לחוד (להלן יחד "האתר"), המתופעלים על-ידי קבוצת מ.ג.ע.ר בע"מ ו/או מ.ג.ע.ר - מרכז גביה ממוחשבת בע"מ (להלן "החברה"), מתוקף התקשרותה כדין עם תאגידים ו/או רשויות ו/או נותני שירותים אחרים ככל שיהיו מעת לעת (להלן יחד "התאגידים").      
            </p>

            <p align="right" dir="rtl">
            האתר מיועד לאפשר לך לזמן תורים מול התאגידים; לבצע תשלומים ולשלם חשבונות ו/או חובות כלפי התאגידים על-ידי החברה ו/או באמצעות העברת תשלומים לסליקה באמצעות חברה צד ג' (להלן "התשלומים"); ליזום פניות ו/או לשגר טפסים מקוונים אל התאגידים ולקבל מענה או הודעות מהם; לעיין ולצפות במידע אישי, בהסטוריית תשלומים ובנתוני מדידה שונים בקשר לשירותים שאתה צורך ו/או מקבל מהתאגידים; לדווח על מפגעים ותקלות; לשתף תמונות או מיקום או נתוני תקשורת אחרים לפי צורך (להלן יחד - "השירותים") ולעקוב אחר הטיפול באחד או יותר משירותים המפורטים לעיל. 
            </p>

            <p align="right" dir="rtl">
            ** למען הנוחיות בלבד, תקנון זה מנוסח בלשון זכר אולם הוראותיו מתייחסות בהתאמה כמובן גם לנקבה. עמכן הסליחה.
            </p>

            <p align="right" dir="rtl">
            תחולה והסכמתך לתנאי התקנון
            </p>

            <p align="right" dir="rtl">
            1.        השימוש באתר, בתכנים הכלולים בו ובשירותים השונים הזמינים דרכו או מוצעים על-ידו, מעיד על הסכמתך להוראות ולתנאי תקנון זה, לרבות התחייבותך לפעול על-פיו, על כן הנך מתבקש לקרוא את התנאים שלהלן בקפידה.            
            </p>

            <p align="right" dir="rtl">
            2.        אם אינן מעוניין לקבל ו/או לאשר את תנאי התקנון שלהלן, כולם או חלקם, עליך להפסיק את השימוש באתר לאלתר.
            </p>

            <p align="right" dir="rtl">
            3.        החברה שומרת לעצמה את הזכות לשנות, למחוק ו/או להוסיף על תנאי תקנון זה בכל עת וללא התחייבות למתן הודעה מוקדמת או בדיעבד. שימושך באתר לאחר ביצוע תוספות ו/או שינויים מעיד על הסכמתך לשינויים אלו, ולכן אנו ממליצים לך לעיין בתנאים אלו מחדש מעת לעת. אם אינך מסכים לשינויים מסוימים, אנא הימנע מהמשך שימוש באתר או פנה אלינו לסיוע כדי לתת לך פתרונות חלופיים. נוסח התקנון המחייב והקובע בכל מועד הינו נוסח התקנון המפורסם באתר.            
            </p>

            <p align="right" dir="rtl">
            4.        תנאי תקנון זה אינם באים להחליף תנאים, תנאי שימוש או מדיניות פרטיות של כל אתר או עמוד אחר העשוי להיות מקושר או זמין באמצעות או דרך אתר זה. הגלישה והשימוש בכל אתר אחר כאמור כפופים לתנאיו הפרטניים של אותו אתר, נוסף וללא קשר לתנאי תקנון זה, ומומלץ על כן לעיין בהם בנפרד.            
            </p>

            <p align="right" dir="rtl">
            5.        תנאים אלה המפורטים להלן חלים על כל שימוש באתר, לרבות צריכה ו/או ביצוע התשלומים דרכו ו/או באמצעותו ו/או באמצעות סליקת התשלומים על ידי חברה צד ג', צפייה ו/או גישה לתכנים הכלולים בו והשירותים המוצעים בו, בין אם באמצעות מחשב ביתי, מחשב נייד, מכשיר סלולארי, טאבלט ו/או כל מחשב ו/או מכשיר תקשורת אחר, דרכו מתאפשרת הגישה לאתר ו/או לאפליקציה, באמצעות כל תצורה ודרך כל מערכת הפעלה מתאימה. בנוסף, תנאים אלו חלים על השימוש באתר באמצעות כל רשת ו/או אמצעי תקשורת ו/או חיבור אחרים.            
            </p>

            <p align="right" dir="rtl">
            6.        החברה תהא רשאית לפעול בדרך של השעיה, חסימה ו/או נקיטת כל פעולה (משפטית או אחרת) כנגד כל משתמש אשר יפר את תנאי השימוש שלהלן.
            </p>

            <div class="container mt-3">
                
            </div>

            <br></br>
            <br></br>

        </div>
    </div>
    )
}

export default CardProfile;