import {React} from 'react';
import Nav from "../component/Nav";
import '../style/Terms.css';


function CardProfile(){
    return(
        <div className="container-fluid">
        

        <div className="bg-warning" dir="rtl">
            <h2 className="text-center">תנאי שימוש ומדיניות פרטיות בשירותי האתר</h2>
            <p align="right" dir="rtl">
            תנאי השימוש ומדיניות הפרטיות שלהלן (יחד - "התקנון") חלים על כל גולש או משתמש בשירותים הדיגיטליים השונים (להלן "הגולש" או "המשתמש") המוצעים באתר ו/או ביישומון ("אפליקצייה") זה ו/או באמצעותם יחד או לחוד (להלן יחד "האתר").
            </p>

            <p align="right"className="Pterms" dir="rtl">
            האתר מיועד לאפשר למשתמש להגיש בקשת נסיעה או לחפש נסיעה מתאימה ולתאם. 
            </p>

            <p align="right" dir="rtl" className="Pterms">
            ** למען הנוחיות בלבד, תקנון זה מנוסח בלשון זכר אולם הוראותיו מתייחסות בהתאמה כמובן גם לנקבה. עמכן הסליחה.
            </p>

            <p align="right" dir="rtl" className="Pterms">
            תחולה והסכמתך לתנאי התקנון
            </p>

            <p align="right" dir="rtl" className="Pterms" >
            1.        השימוש באתר, בתכנים הכלולים בו ובשירותים השונים הזמינים דרכו או מוצעים על-ידו, מעיד על הסכמתך להוראות ולתנאי תקנון זה, לרבות התחייבותך לפעול על-פיו, על כן הנך מתבקש לקרוא את התנאים שלהלן בקפידה.            
            </p>

            <p align="right" dir="rtl" className="Pterms">
            2.        אם אינן מעוניין לקבל ו/או לאשר את תנאי התקנון שלהלן, כולם או חלקם, עליך להפסיק את השימוש באתר לאלתר.
            </p>

            <p align="right" dir="rtl" className="Pterms">
            3.        החברה שומרת לעצמה את הזכות לשנות, למחוק ו/או להוסיף על תנאי תקנון זה בכל עת וללא התחייבות למתן הודעה מוקדמת או בדיעבד. שימושך באתר לאחר ביצוע תוספות ו/או שינויים מעיד על הסכמתך לשינויים אלו, ולכן אנו ממליצים לך לעיין בתנאים אלו מחדש מעת לעת. אם אינך מסכים לשינויים מסוימים, אנא הימנע מהמשך שימוש באתר
            </p>

            <p align="right" dir="rtl" className="Pterms">
            4.        תנאי תקנון זה אינם באים להחליף תנאים, תנאי שימוש או מדיניות פרטיות של כל אתר או עמוד אחר העשוי להיות מקושר או זמין באמצעות או דרך אתר זה. הגלישה והשימוש בכל אתר אחר כאמור כפופים לתנאיו הפרטניים של אותו אתר, נוסף וללא קשר לתנאי תקנון זה, ומומלץ על כן לעיין בהם בנפרד.            
            </p>

            <p align="right" dir="rtl" className="Pterms">
            5.        תנאים אלה המפורטים להלן חלים על כל שימוש באתר, צפייה ו/או גישה לתכנים הכלולים בו והשירותים המוצעים בו, בין אם באמצעות מחשב ביתי, מחשב נייד, מכשיר סלולארי, טאבלט ו/או כל מחשב ו/או מכשיר תקשורת אחר, דרכו מתאפשרת הגישה לאתר ו/או לאפליקציה, באמצעות כל תצורה ודרך כל מערכת הפעלה מתאימה. 
            </p>

            <p align="right" dir="rtl" className="Pterms">
            6.        החברה תהא רשאית לפעול בדרך של השעיה, חסימה ו/או נקיטת כל פעולה (משפטית או אחרת) כנגד כל משתמש אשר יפר את תנאי השימוש שלהלן.
            </p>

            <div class="container mt-3">
                
            </div>

            <br></br>
            <br></br>

        </div>
    </div>
    )
}

export default CardProfile;